app/controllers/create_controller.rb

  def create
    @character = Character.new(
      name: params[:name],
      sex: params[:sex],
      age: params[:age],
      race: params[:race],
      height: params[:height],
      hair: params[:hair],
      eye: params[:eye],
      skin: params[:skin],
      form: params[:form],
      dress: params[:dress],
      image_name: "default_user.jpg",
      personality1: params[:personality1],
      personality2: params[:personality2],
      personality3: params[:personality3],
      personality4: params[:personality4],
      personality5: params[:personality5],
      personality6: params[:personality6],
      user_id: @current_user.id,
      others1: params[:group]
    )
    @character.save
---
INSERT INTO "characters" ("name", "created_at", "updated_at", "image_name", "sex", "race", "hair", "eye", "skin", "form", "dress", "special", "personality1", "personality2", "personality3", "personality4", "personality5", "personality6", "others1", "others2", "others3", "age", "height", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def show
    @character = Character.find_by(id: params[:id])
---
SELECT "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]

  def group
    @character = Character.find_by(id: params[:id])
    @characters = Character.where(
      user_id: @current_user.id,
      others1: @character.others1
    )
---
SELECT "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT "characters".* FROM "characters" WHERE "characters"."user_id" = ? AND "characters"."others1" = ?  [["user_id", 1], ["others1", "グループ1"]]

  def edit
    @character = Character.find_by(id: params[:id])
---
SELECT "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]

  def update
    @character = Character.find_by(id: params[:id])
    @character.name = params[:name]
    @character.sex = params[:sex]
    @character.age = params[:age]
    @character.race = params[:race]
    @character.height = params[:height]
    @character.hair = params[:hair]
    @character.eye = params[:eye]
    @character.skin = params[:skin]
    @character.form = params[:form]
    @character.dress = params[:dress]
    @character.personality1 = params[:personality1]
    @character.personality2 = params[:personality2]
    @character.personality3 = params[:personality3]
    @character.personality4 = params[:personality4]
    @character.personality5 = params[:personality5]
    @character.personality6 = params[:personality6]
    @character.others1 = params[:group]

    if params[:image_name]
      @character.image_name = "#{@character.id}.jpg"
      image = params[:image_name]
      File.binwrite("public/user_images/#{@character.image_name}", image.read)
    end

    if @character.save
---
SELECT "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "characters" SET "updated_at" = ?, "sex" = ?, "race" = ?, "hair" = ?, "eye" = ?, "skin" = ?, "form" = ?, "dress" = ?, "personality1" = ?, "personality2" = ?, "personality3" = ?, "personality4" = ?, "personality5" = ?, "personality6" = ?, "age" = ?, "height" = ? WHERE "characters"."id" = ?

  def destroy
    @character = Character.find_by(id: params[:id])
    @character.destroy
---
SELECT "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "characters" WHERE "characters"."id" = ?  [["id", 9]]