app/controllers/users_controller.rb

  def signin
    @user = User.new(
      email: params[:email],
      name: params[:name],
      password: params[:password]
    )
    if @user.save
---
INSERT INTO "users" ("created_at", "updated_at", "name", "email", "password") VALUES (?, ?, ?, ?, ?)  [["created_at", "2022-09-17 12:51:56.971676"], ["updated_at", "2022-09-17 12:51:56.971676"], ["name", "stella"], ["email", "hog.orangeboy0527@icloud.com"], ["password", "[FILTERED]"]]

  def user_home
    @characters = Character.where(user_id: @current_user.id).order(id: :desc)
---
SELECT "characters".* FROM "characters" WHERE "characters"."user_id" = ? ORDER BY "characters"."id" DESC  [["user_id", 1]]